Autodesk.Revit.DB.ElementMulticlassFilter.#ctor(System.Collections.Generic.IList`1{System.Type},System.Boolean)
Constructs a filter using multiple types
typeList:
The list of types to match
inverted:
True if the filter should match all elements which are not of the given class.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more input types are not subclasses of Element.
-or-
One or more of the types do not exist in Revit's native object model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ElementMulticlassFilter.#ctor(System.Collections.Generic.IList`1{System.Type})
Constructs a filter using multiple types
typeList:
The list of types to match
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more input types are not subclasses of Element.
-or-
One or more of the types do not exist in Revit's native object model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012